summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_regdef.h
/** \\brief  Projected TRIGGER Increment Sum Relations for Action_i */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_T_Bits B;
} Ifx_GTM_DPLL_PDT_T;

/** \\brief  ACTION Position/Value Action Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSA_Bits B;
} Ifx_GTM_DPLL_PSA;

/** \\brief  DPLL Calculated Position Value Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSAC_Bits B;
} Ifx_GTM_DPLL_PSAC;

/** \\brief  Accurate Calculated Position Stamp of Last STATE Input */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSSC_Bits B;
} Ifx_GTM_DPLL_PSSC;

/** \\brief  Measured Position Stamp of Last STATE Input
 * Measured Position Stamp of Last But One STATE Input
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Measured Position Stamp of Last STATE Input */
    Ifx_GTM_DPLL_PSSM_0_PSSM_0_Bits B_PSSM_0;
    /** \brief Bitfield access: Measured Position Stamp of Last But One STATE Input */
    Ifx_GTM_DPLL_PSSM_0_PSSM_OLD_1_Bits B_PSSM_OLD_1;
} Ifx_GTM_DPLL_PSSM_0;

/** \\brief  Measured Position Stamp of Last STATE Input
 * Measured Position Stamp of Last But One STATE Input
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Measured Position Stamp of Last STATE Input */
    Ifx_GTM_DPLL_PSSM_1_PSSM_1_Bits B_PSSM_1;
    /** \brief Bitfield access: Measured Position Stamp of Last But One STATE Input */
    Ifx_GTM_DPLL_PSSM_1_PSSM_OLD_0_Bits B_PSSM_OLD_0;
} Ifx_GTM_DPLL_PSSM_1;

/** \\brief  Actual Calculated Position Stamp of Last TRIGGER Input */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSTC_Bits B;
} Ifx_GTM_DPLL_PSTC;

/** \\brief  Measured Position Stamp of Last TRIGGER Input
 * Measured Position Stamp of Last But One TRIGGER Input
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Measured Position Stamp of Last TRIGGER Input */
    Ifx_GTM_DPLL_PSTM_0_PSTM_0_Bits B_PSTM_0;
    /** \brief Bitfield access: Measured Position Stamp of Last But One TRIGGER Input */
    Ifx_GTM_DPLL_PSTM_0_PSTM_OLD_1_Bits B_PSTM_OLD_1;
} Ifx_GTM_DPLL_PSTM_0;

/** \\brief  Measured Position Stamp of Last TRIGGER Input
 * Measured Position Stamp of Last But One TRIGGER Input
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Measured Position Stamp of Last TRIGGER Input */
    Ifx_GTM_DPLL_PSTM_1_PSTM_1_Bits B_PSTM_1;
    /** \brief Bitfield access: Measured Position Stamp of Last But One TRIGGER Input */
    Ifx_GTM_DPLL_PSTM_1_PSTM_OLD_0_Bits B_PSTM_OLD_0;
} Ifx_GTM_DPLL_PSTM_1;

/** \\brief  Plausibility Value of Next Active TRIGGER Slope */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PVT_Bits B;
} Ifx_GTM_DPLL_PVT;

/** \\brief  DPLL RAM Initatlisation Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RAM_INI_Bits B;
} Ifx_GTM_DPLL_RAM_INI;

/** \\brief  Reciprocal Value of Expected Increment Duration STATE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RCDT_SX_Bits B;
} Ifx_GTM_DPLL_RCDT_SX;

/** \\brief  Reciprocal Value of the Expected Nominal Increment Duration STATE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RCDT_SX_NOM_Bits B;
} Ifx_GTM_DPLL_RCDT_SX_NOM;

/** \\brief  Reciprocal Value of Expected Increment Duration TRIGGER */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RCDT_TX_Bits B;
} Ifx_GTM_DPLL_RCDT_TX;

/** \\brief  Reciprocal Value of the Expected Nominal Increment Duration TRIGGER */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RCDT_TX_NOM_Bits B;
} Ifx_GTM_DPLL_RCDT_TX_NOM;

/** \\brief  Nominal STATE Reciprocal Values in FULL_SCALE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RDT_S_Bits B;
} Ifx_GTM_DPLL_RDT_S;

/** \\brief  Actual Reciprocal Value of STATE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RDT_S_ACT_Bits B;
} Ifx_GTM_DPLL_RDT_S_ACT;

/** \\brief  Actual Reciprocal Value of TRIGGER */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_RDT_T_ACT_Bits B;
} Ifx_GTM_DPLL_RDT_T_ACT;

/** \\brief  STATE Locking Range */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_SLR_Bits B;
} Ifx_GTM_DPLL_SLR;

/** \\brief  DPLL Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_STATUS_Bits B;
} Ifx_GTM_DPLL_STATUS;

/** \\brief  DPLL TBU_TS0 Value at last STATE Event */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_TBU_TS0_S_Bits B;
} Ifx_GTM_DPLL_TBU_TS0_S;

