summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_regdef.h
/** \\brief  TOM channel objects */
typedef volatile struct _Ifx_GTM_TOM_CH
{
    Ifx_GTM_TOM_CH_CTRL CTRL;               /**< \brief 0, TOM Channel Control Register’ */
    Ifx_GTM_TOM_CH_SR0 SR0;                 /**< \brief 4, TOM Channel CCU0 Compare Shadow Register */
    Ifx_GTM_TOM_CH_SR1 SR1;                 /**< \brief 8, TOM Channel CCU1 Compare Shadow Register */
    Ifx_GTM_TOM_CH_CM0 CM0;                 /**< \brief C, TOM Channel CCU0 Compare Register */
    Ifx_GTM_TOM_CH_CM1 CM1;                 /**< \brief 10, TOM Channel CCU1 Compare Register */
    Ifx_GTM_TOM_CH_CN0 CN0;                 /**< \brief 14, TOM Channel CCU0 Counter Register */
    Ifx_GTM_TOM_CH_STAT STAT;               /**< \brief 18, TOM Channel Status Register */
    Ifx_GTM_TOM_CH_IRQ_NOTIFY IRQ_NOTIFY;   /**< \brief 1C, TOM Channel Interrupt Notification Register */
    Ifx_GTM_TOM_CH_IRQ_EN IRQ_EN;           /**< \brief 20, TOM Channel Interrupt Enable Register */
    Ifx_GTM_TOM_CH_IRQ_FORCINT IRQ_FORCINT; /**< \brief 24, TOM Channel Software Interrupt Generation Register */
    Ifx_GTM_TOM_CH_IRQ_MODE IRQ_MODE;       /**< \brief 28, TOM IRQ Mode Configuration Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
} Ifx_GTM_TOM_CH;

/** \\brief  TS object */
typedef volatile struct _Ifx_GTM_TS
{
    Ifx_GTM_TS_T_0 T_0;                     /**< \brief 0, Actual Signal TRIGGER Time Stamp Register */
    Ifx_GTM_TS_T_1 T_1;                     /**< \brief 4, Actual Signal TRIGGER Time Stamp Register */
    Ifx_GTM_TS_FTV_T FTV_T;                 /**< \brief 8, Actual Signal TRIGGER Filter Value Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_GTM_TS_S_0 S_0;                     /**< \brief 10, Actual Signal STATE Time Stamp Register */
    Ifx_GTM_TS_S_1 S_1;                     /**< \brief 14, Actual Signal STATE Time Stamp Register */
} Ifx_GTM_TS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  AFD object */
typedef volatile struct _Ifx_GTM_AFD
{
    Ifx_GTM_AFD_CH CH[8];                   /**< \brief 0, AFD FIFO channel objects */
} Ifx_GTM_AFD;

/** \\brief  ARU object */
typedef volatile struct _Ifx_GTM_ARU
{
    Ifx_GTM_ARU_ARU_ACCESS ARU_ACCESS;      /**< \brief 0, ARU Access Register */
    Ifx_GTM_ARU_DATA_H DATA_H;              /**< \brief 4, ARU Access Register Upper Data Word */
    Ifx_GTM_ARU_DATA_L DATA_L;              /**< \brief 8, ARU Access Register Lower Data Word */
    Ifx_GTM_ARU_DBG_ACCESS0 DBG_ACCESS0;    /**< \brief C, Debug Access Channel 0 */
    Ifx_GTM_ARU_DBG_DATA0_H DBG_DATA0_H;    /**< \brief 10, Debug Access 0 Transfer Register Upper Data Word */
    Ifx_GTM_ARU_DBG_DATA0_L DBG_DATA0_L;    /**< \brief 14, Debug Access 0 Transfer Register Lower Data Word */
    Ifx_GTM_ARU_DBG_ACCESS1 DBG_ACCESS1;    /**< \brief 18, Debug Access Channel 0 */
    Ifx_GTM_ARU_DBG_DATA1_H DBG_DATA1_H;    /**< \brief 1C, Debug Access 1 Transfer Register Upper Data Word */
    Ifx_GTM_ARU_DBG_DATA1_L DBG_DATA1_L;    /**< \brief 20, Debug Access 1 Transfer Register Lower Data Word */
    Ifx_GTM_ARU_IRQ_NOTIFY IRQ_NOTIFY;      /**< \brief 24, ARU Interrupt Notification Register */
    Ifx_GTM_ARU_IRQ_EN IRQ_EN;              /**< \brief 28, ARU Interrupt Enable Register */
    Ifx_GTM_ARU_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 2C, ARU_NEW_DATA_IRQ Forcing Interrupt Register */
    Ifx_GTM_ARU_IRQ_MODE IRQ_MODE;          /**< \brief 30, IRQ Mode Configuration Register */
} Ifx_GTM_ARU;

/** \\brief  ATOM objects */
typedef volatile struct _Ifx_GTM_ATOM
{
    Ifx_GTM_ATOM_CH CH0;                    /**< \brief 0, ATOM channel objects */
    Ifx_GTM_ATOM_AGC AGC;                   /**< \brief 40, ACG object */
    Ifx_GTM_ATOM_CH CH1;                    /**< \brief 80, ATOM channel objects */
    unsigned char reserved_C0[64];          /**< \brief C0, \internal Reserved */
    Ifx_GTM_ATOM_CH CH2;                    /**< \brief 100, ATOM channel objects */
    unsigned char reserved_140[64];         /**< \brief 140, \internal Reserved */
    Ifx_GTM_ATOM_CH CH3;                    /**< \brief 180, ATOM channel objects */
    unsigned char reserved_1C0[64];         /**< \brief 1C0, \internal Reserved */
    Ifx_GTM_ATOM_CH CH4;                    /**< \brief 200, ATOM channel objects */
    unsigned char reserved_240[64];         /**< \brief 240, \internal Reserved */
    Ifx_GTM_ATOM_CH CH5;                    /**< \brief 280, ATOM channel objects */
    unsigned char reserved_2C0[64];         /**< \brief 2C0, \internal Reserved */
    Ifx_GTM_ATOM_CH CH6;                    /**< \brief 300, ATOM channel objects */
    unsigned char reserved_340[64];         /**< \brief 340, \internal Reserved */
    Ifx_GTM_ATOM_CH CH7;                    /**< \brief 380, ATOM channel objects */
    unsigned char reserved_3C0[1088];       /**< \brief 3C0, \internal Reserved */
} Ifx_GTM_ATOM;

/** \\brief  BRIDGE object */
typedef volatile struct _Ifx_GTM_BRIDGE
{
    Ifx_GTM_BRIDGE_MODE MODE;               /**< \brief 0, GTM to SPB BRIDGE MODE */
    Ifx_GTM_BRIDGE_PTR1 PTR1;               /**< \brief 4, GTM to SPB BRIDGE PTR1 */
    Ifx_GTM_BRIDGE_PTR2 PTR2;               /**< \brief 8, GTM to SPB BRIDGE PTR2 */
} Ifx_GTM_BRIDGE;

/** \\brief  CMP object */
typedef volatile struct _Ifx_GTM_CMP
{
    Ifx_GTM_CMP_EN EN;                      /**< \brief 0, CMP Comparator Enable Register */
    Ifx_GTM_CMP_IRQ_NOTIFY IRQ_NOTIFY;      /**< \brief 4, CMP Event Notification Register */
    Ifx_GTM_CMP_IRQ_EN IRQ_EN;              /**< \brief 8, CMP Interrupt Enable Register */
    Ifx_GTM_CMP_IRQ_FORCINT IRQ_FORCINT;    /**< \brief C, CMP Interrupt Force Register */
    Ifx_GTM_CMP_IRQ_MODE IRQ_MODE;          /**< \brief 10, CMP IRQ Mode Configuration Register */
    Ifx_GTM_CMP_EIRQ_EN EIRQ_EN;            /**< \brief 14, CMP Error Interrupt Enable Register */
} Ifx_GTM_CMP;

/** \\brief  CMU object */
typedef volatile struct _Ifx_GTM_CMU
{
    Ifx_GTM_CMU_CLK_EN CLK_EN;              /**< \brief 0, CMU Clock Enable Register */
    Ifx_GTM_CMU_GCLK_NUM GCLK_NUM;          /**< \brief 4, CMU Global Clock Control Numerator Register */
    Ifx_GTM_CMU_GCLK_DEN GCLK_DEN;          /**< \brief 8, CMU Global Clock Control Denominator Register */
    Ifx_GTM_CMU_CLK0_5 CLK0_5[6];           /**< \brief C, CLK objects */
    Ifx_GTM_CMU_CLK_6 CLK_6;                /**< \brief 24, CLK objects */
    Ifx_GTM_CMU_CLK_7 CLK_7;                /**< \brief 28, CLK objects */
    Ifx_GTM_CMU_ECLK ECLK[3];               /**< \brief 2C, ECLK objects */
    Ifx_GTM_CMU_FXCLK FXCLK;                /**< \brief 44, FXCLK objects */
} Ifx_GTM_CMU;

/** \\brief  DPLL object */
typedef volatile struct _Ifx_GTM_DPLL
{
    Ifx_GTM_DPLL_CTRL_0 CTRL_0;             /**< \brief 0, DPLL Control Register 0 */
    Ifx_GTM_DPLL_CTRL_1 CTRL_1;             /**< \brief 4, DPLL Control Register 1 */
    Ifx_GTM_DPLL_CTRL_2 CTRL_2;             /**< \brief 8, DPLL Control Register 2 */
    Ifx_GTM_DPLL_CTRL_3 CTRL_3;             /**< \brief C, DPLL Control Register 3 */
    Ifx_GTM_DPLL_CTRL_4 CTRL_4;             /**< \brief 10, DPLL Control Register 4 */
    unsigned char reserved_14[4];           /**< \brief 14, \internal Reserved */
    Ifx_GTM_DPLL_ACT_STA ACT_STA;           /**< \brief 18, DPLL ACTION Status Register With Shadow Register */
    Ifx_GTM_DPLL_OSW OSW;                   /**< \brief 1C, DPLL Offset And Switch Old/New Address Register */
    Ifx_GTM_DPLL_AOSV_2 AOSV_2;             /**< \brief 20, DPLL Address Offset Register For APT In RAM Region 2 */
    Ifx_GTM_DPLL_APT APT;                   /**< \brief 24, DPLL Actual RAM Pointer to RAM Regions 2a, b and d */
    Ifx_GTM_DPLL_APS APS;                   /**< \brief 28, DPLL Actual RAM Pointer to RAM Regions 1c1, 1c2 and 1c4 */
    Ifx_GTM_DPLL_APT_2C APT_2C;             /**< \brief 2C, DPLL Actual RAM Pointer to RAM Region 2C */
    Ifx_GTM_DPLL_APS_1C3 APS_1C3;           /**< \brief 30, DPLL Actual RAM Pointer to RAM Region 1C3 */
    Ifx_GTM_DPLL_NUTC NUTC;                 /**< \brief 34, DPLL Number of Recent TRIGGER Events Used for Calculations */
    Ifx_GTM_DPLL_NUSC NUSC;                 /**< \brief 38, DPLL Number of Recent STATE Events Used for Calculations */
    Ifx_GTM_DPLL_NTI_CNT NTI_CNT;           /**< \brief 3C, DPLL Number of Active TRIGGER Events to Interrupt */
    Ifx_GTM_DPLL_IRQ_NOTIFY IRQ_NOTIFY;     /**< \brief 40, DPLL Interrupt Notification Register */
    Ifx_GTM_DPLL_IRQ_EN IRQ_EN;             /**< \brief 44, DPLL Interrupt Enable Register */
    Ifx_GTM_DPLL_IRQ_FORCINT IRQ_FORCINT;   /**< \brief 48, DPLL Interrupt Force Register */
    Ifx_GTM_DPLL_IRQ_MODE IRQ_MODE;         /**< \brief 4C, DPLL Interrupt Mode Register */
    Ifx_GTM_DPLL_EIRQ_EN EIRQ_EN;           /**< \brief 50, DPLL Error Interrupt Enable Register */
    unsigned char reserved_54[92];          /**< \brief 54, \internal Reserved */
    Ifx_GTM_DPLL_INC_CNT1 INC_CNT1;         /**< \brief B0, DPLL Counter for Pulses for TBU_TS1 to be sent in Automatic End Mode */
    Ifx_GTM_DPLL_INC_CNT2 INC_CNT2;         /**< \brief B4, DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End Mode when SMC=RMO=1 */
    Ifx_GTM_DPLL_APT_SYNC APT_SYNC;         /**< \brief B8, DPLL Old RAM Pointer and Offset Value for TRIGGER */
    Ifx_GTM_DPLL_APS_SYNC APS_SYNC;         /**< \brief BC, DPLL Old RAM Pointer and Offset Value for STATE */
    Ifx_GTM_DPLL_TBU_TS0_T TBU_TS0_T;       /**< \brief C0, DPLL TBU_TS0 Value at last TRIGGER Event */
    Ifx_GTM_DPLL_TBU_TS0_S TBU_TS0_S;       /**< \brief C4, DPLL TBU_TS0 Value at last STATE Event */
    Ifx_GTM_DPLL_ADD_IN_LD1 ADD_IN_LD1;     /**< \brief C8, DPLL Direct Load Input Value for SUB_INC1 */
    Ifx_GTM_DPLL_ADD_IN_LD2 ADD_IN_LD2;     /**< \brief CC, DPLL Direct Load Input Value for SUB_INC1 */
    unsigned char reserved_D0[44];          /**< \brief D0, \internal Reserved */
    Ifx_GTM_DPLL_STATUS STATUS;             /**< \brief FC, DPLL Status Register */
    Ifx_GTM_DPLL_ID_PMTR ID_PMTR[24];       /**< \brief 100, DPLL ID Information For Input Signal PMTR n Register */
    unsigned char reserved_160[128];        /**< \brief 160, \internal Reserved */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER CTRL_0_SHADOW_TRIGGER;   /**< \brief 1E0, DPLL Control0 Shadow Trigger Register */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE CTRL_0_SHADOW_STATE;   /**< \brief 1E4, DPLL Control 0 Shadow STATE Register */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER CTRL_1_SHADOW_TRIGGER;   /**< \brief 1E8, DPLL Control 1 Shadow TRIGGER Register */
    Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE CRTL_1_SHADOW_STATE;   /**< \brief 1EC, DPLL Control 1 Shadow STATE Register */
    unsigned char reserved_1F0[12];         /**< \brief 1F0, \internal Reserved */
    Ifx_GTM_DPLL_RAM_INI RAM_INI;           /**< \brief 1FC, DPLL RAM Initatlisation Register */
    Ifx_GTM_DPLL_PSA PSA[24];               /**< \brief 200, ACTION Position/Value Action Request Register */
    unsigned char reserved_260[32];         /**< \brief 260, \internal Reserved */
    Ifx_GTM_DPLL_DLA DLA[24];               /**< \brief 280, ACTION Time To React Before PSAi Register */
    unsigned char reserved_2E0[32];         /**< \brief 2E0, \internal Reserved */
    Ifx_GTM_DPLL_NA NA[24];                 /**< \brief 300, Calculated Number Of TRIGGER/STATE Increments To ACTION */
    unsigned char reserved_360[32];         /**< \brief 360, \internal Reserved */
    Ifx_GTM_DPLL_DTA DTA[24];               /**< \brief 380, Calculated Relative Time To ACTION_i Register */
    unsigned char reserved_3E0[32];         /**< \brief 3E0, \internal Reserved */
    Ifx_GTM_TS TS;                          /**< \brief 400, TS object */
    Ifx_GTM_DPLL_FTV_S FTV_S;               /**< \brief 418, Actual Signal STATE Filter Value Register */
    unsigned char reserved_41C[4];          /**< \brief 41C, \internal Reserved */
    Ifx_GTM_DPLL_THMI THMI;                 /**< \brief 420, TRIGGER hold time min value */
    Ifx_GTM_DPLL_THMA THMA;                 /**< \brief 424, TRIGGER Hold Time Max Value */
    Ifx_GTM_DPLL_THVAL THVAL;               /**< \brief 428, Measured Last Pulse Time from Valid to Invalid TRIGGER Slope */
    unsigned char reserved_42C[4];          /**< \brief 42C, \internal Reserved */
    Ifx_GTM_DPLL_TOV TOV;                   /**< \brief 430, Time Out Value of active TRIGGER Slope */
    Ifx_GTM_DPLL_TOV_S TOV_S;               /**< \brief 434, Time Out Value of active STATE Slope */
    Ifx_GTM_DPLL_ADD_IN_CAL1 ADD_IN_CAL1;   /**< \brief 438, Calculated ADD_IN Value for SUB_INC1 Generation */
    Ifx_GTM_DPLL_ADD_IN_CAL2 ADD_IN_CAL2;   /**< \brief 43C, Calculated ADD_IN Value for SUB_INC2 Generation */
    Ifx_GTM_DPLL_MPVAL1 MPVAL1;             /**< \brief 440, Missing Pulses to be Added/Subtracted Directly to SUB_INC1 and INC_CNT1 Once */
    Ifx_GTM_DPLL_MPVAL2 MPVAL2;             /**< \brief 444, Missing Pulses to be Added/Subtracted Directly to SUB_INC2 and INC_CNT2 Once */
    Ifx_GTM_DPLL_NMB_T_TAR NMB_T_TAR;       /**< \brief 448, Target Number of Pulses to be sent in normal mode Register */
    Ifx_GTM_DPLL_NMB_T_TAR_OLD NMB_T_TAR_OLD;   /**< \brief 44C, Target Number of Pulses to be sent in normal mode Register */
    Ifx_GTM_DPLL_NMB_S_TAR NMB_S_TAR;       /**< \brief 450, Target Number of Pulses to be sent in emergency mode Register */
    Ifx_GTM_DPLL_NMB_S_TAR_OLD NMB_S_TAR_OLD;   /**< \brief 454, Target Number of Pulses to be sent in emergency mode Register */
    unsigned char reserved_458[8];          /**< \brief 458, \internal Reserved */
    Ifx_GTM_DPLL_RCDT_TX RCDT_TX;           /**< \brief 460, Reciprocal Value of Expected Increment Duration TRIGGER */
    Ifx_GTM_DPLL_RCDT_SX RCDT_SX;           /**< \brief 464, Reciprocal Value of Expected Increment Duration STATE */
    Ifx_GTM_DPLL_RCDT_TX_NOM RCDT_TX_NOM;   /**< \brief 468, Reciprocal Value of the Expected Nominal Increment Duration TRIGGER */
    Ifx_GTM_DPLL_RCDT_SX_NOM RCDT_SX_NOM;   /**< \brief 46C, Reciprocal Value of the Expected Nominal Increment Duration STATE */
    Ifx_GTM_DPLL_RDT_T_ACT RDT_T_ACT;       /**< \brief 470, Actual Reciprocal Value of TRIGGER */
    Ifx_GTM_DPLL_RDT_S_ACT RDT_S_ACT;       /**< \brief 474, Actual Reciprocal Value of STATE */
    Ifx_GTM_DPLL_DT_T_ACT DT_T_ACT;         /**< \brief 478, Duration of Last TRIGGER Increment */
    Ifx_GTM_DPLL_DT_S_ACT DT_S_ACT;         /**< \brief 47C, Duration of Last STATE Increment [DT_S_ACT] */
    Ifx_GTM_DPLL_EDT_T EDT_T;               /**< \brief 480, Difference of prediction to actual value of the last TRIGGER increment */
    Ifx_GTM_DPLL_MEDT_T MEDT_T;             /**< \brief 484, Weighted difference of Prediction up to the Last TRIGGER Increment */
    Ifx_GTM_DPLL_EDT_S EDT_S;               /**< \brief 488, Difference of Prediction to actual value for Last STATE Increment */
    Ifx_GTM_DPLL_MEDT_S MEDT_S;             /**< \brief 48C, Weighted difference of Prediction up to the Last STATE Increment */
    Ifx_GTM_DPLL_CDT_TX CDT_TX;             /**< \brief 490, Prediction of the actual TRIGGER Increment */
    Ifx_GTM_DPLL_CDT_SX CDT_SX;             /**< \brief 494, Prediction of the actual STATE Increment */
    Ifx_GTM_DPLL_CDT_TX_NOM CDT_TX_NOM;     /**< \brief 498, Prediction of the nominal TRIGGER Increment duration */
    Ifx_GTM_DPLL_CDT_SX_NOM CDT_SX_NOM;     /**< \brief 49C, Prediction of the nominal STATE increment duration */
    Ifx_GTM_DPLL_TLR TLR;                   /**< \brief 4A0, TRIGGER locking range */
    Ifx_GTM_DPLL_SLR SLR;                   /**< \brief 4A4, STATE Locking Range */
    unsigned char reserved_4A8[88];         /**< \brief 4A8, \internal Reserved */
    Ifx_GTM_DPLL_PDT_T PDT_T[24];           /**< \brief 500, Projected TRIGGER Increment Sum Relations for Action_i */
    unsigned char reserved_560[96];         /**< \brief 560, \internal Reserved */
    Ifx_GTM_DPLL_MLS1 MLS1;                 /**< \brief 5C0, Calculated Number of Sub-Pulses between Two STATE Events */
    Ifx_GTM_DPLL_MLS2 MLS2;                 /**< \brief 5C4, Calculated Number of Sub-Pulses between Two STATE Events */
    Ifx_GTM_DPLL_CNT_NUM1 CNT_NUM1;         /**< \brief 5C8, Number of Sub-Pulses of SUB_INC1 in Continuous Mode */
    Ifx_GTM_DPLL_CNT_NUM2 CNT_NUM2;         /**< \brief 5CC, Number of Sub-Pulses of SUB_INC2 in Continuous Mode */
    Ifx_GTM_DPLL_PVT PVT;                   /**< \brief 5D0, Plausibility Value of Next Active TRIGGER Slope */
    unsigned char reserved_5D4[12];         /**< \brief 5D4, \internal Reserved */
    Ifx_GTM_DPLL_PSTC PSTC;                 /**< \brief 5E0, Actual Calculated Position Stamp of Last TRIGGER Input */
    Ifx_GTM_DPLL_PSSC PSSC;                 /**< \brief 5E4, Accurate Calculated Position Stamp of Last STATE Input */
    Ifx_GTM_DPLL_PSTM_0 PSTM_0;             /**< \brief 5E8, Measured Position Stamp of Last TRIGGER Input */
    Ifx_GTM_DPLL_PSTM_1 PSTM_1;             /**< \brief 5EC, Measured Position Stamp of Last TRIGGER Input */
    Ifx_GTM_DPLL_PSSM_0 PSSM_0;             /**< \brief 5F0, Measured Position Stamp of Last STATE Input */
    Ifx_GTM_DPLL_PSSM_1 PSSM_1;             /**< \brief 5F4, Measured Position Stamp of Last STATE Input */
    Ifx_GTM_DPLL_NMB_T NMB_T;               /**< \brief 5F8, Number of Pulses of Current Increment in Normal Mode */
    Ifx_GTM_DPLL_NMB_S NMB_S;               /**< \brief 5FC, Number of Pulses of Current Increment in Emergency Mode */
    Ifx_GTM_DPLL_RDT_S RDT_S[64];           /**< \brief 600, Nominal STATE Reciprocal Values in FULL_SCALE */
    Ifx_GTM_DPLL_TSF_S TSF_S[64];           /**< \brief 700, Time Stamp Field of STATE Events */
    Ifx_GTM_DPLL_ADT_S ADT_S[64];           /**< \brief 800, Adapt Values for All STATE Increments */
    Ifx_GTM_DPLL_DT_S DT_S[64];             /**< \brief 900, Nominal STATE Increment Values for FULL_SCALE */
    unsigned char reserved_A00[1024];       /**< \brief A00, \internal Reserved */
    Ifx_GTM_DPLL_TSAC TSAC[24];             /**< \brief E00, DPLL Calculate Time Stamp Register */
    unsigned char reserved_E60[32];         /**< \brief E60, \internal Reserved */
    Ifx_GTM_DPLL_PSAC PSAC[24];             /**< \brief E80, DPLL Calculated Position Value Register */
    unsigned char reserved_EE0[32];         /**< \brief EE0, \internal Reserved */
    Ifx_GTM_DPLL_ACB ACB[6];                /**< \brief F00, DPLL Action Control i Register */
} Ifx_GTM_DPLL;

/** \\brief  F2A object */
typedef volatile struct _Ifx_GTM_F2A
{
    Ifx_GTM_F2A_RD_CH RD_CH[8];             /**< \brief 0, F2A ARU RD FIFO address */
    Ifx_GTM_F2A_STR_CH STR_CH[8];           /**< \brief 20, F2A Stream configuration */
    Ifx_GTM_F2A_ENABLE ENABLE;              /**< \brief 40, F2A0 Stream Activation Register */
} Ifx_GTM_F2A;

